{
  "backend/main.mo": "Defines an actor storing written answers in a Map and exposes functions to save an answer and retrieve all answers.",
  "backend/migration.mo": "Provides a migration from old rating-based answers to new text-based answers by converting stored records.",
  "feature_evidence.json": "Lists implemented features, associated frontend files, components, and test IDs with high‑confidence evidence.",
  "frontend-file-summaries.txt": "Contains short summaries of multiple frontend files describing their roles in the app.",
  "frontend/index.css": "Defines global Tailwind-based styles and warm color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app and setting metadata.",
  "frontend/src/App.tsx": "Main React app component managing view switching and providers for theme and React Query.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing hero section, navigation, main content container, and footer.",
  "frontend/src/components/QuestionCard.tsx": "Renders questions with a textarea answer input, navigation controls, validation, and save handling.",
  "frontend/src/components/StarRating.tsx": "Empty or placeholder star rating component file.",
  "frontend/src/data/loveQuestions.ts": "Exports a list of 18 love‑themed questions with stable IDs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor, refreshing it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAnswers.ts": "React Query hook that fetches all saved answers from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSaveAnswer.ts": "Defines a React Query mutation to save a written answer via the backend actor, with validation and success/error toasts.",
  "frontend/src/index.css": "Configures global Tailwind styles, custom color variables, and theme settings for light and dark romantic UI styling.",
  "frontend/src/lib/dateFormat.ts": "Exports a helper to format timestamps into a readable date string using US locale options.",
  "frontend/src/lib/questionNavigation.ts": "Provides utility functions for navigating between questions sequentially or randomly.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/views/SavedAnswersView.tsx": "Renders a list of saved answers with loading/error states, sorting by timestamp, and romantic-themed UI elements.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and plugins to support the romantic design system.",
  "project_state.json": "Metadata describing the project state, features, requirements, and development context."
}