{
  "kind": "build_request",
  "title": "Replace 1–5 star rating with written answers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Replace the 1–5 star rating input on the question screen with a free-form written answer input (multi-line text), and update all user-facing labels/buttons/messages accordingly in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the star rating to write answer"
        ]
      },
      "acceptanceCriteria": [
        "The question screen no longer renders the StarRating component.",
        "A text input (textarea) is shown for the user to write an answer.",
        "The Save button is disabled until the written answer is non-empty (after trimming whitespace).",
        "All user-facing strings related to the answer input reflect written answers (e.g., replace “Rate this moment:” and “Rating:” with appropriate wording)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Update the save-answer flow from the question screen to persist a written answer instead of a numeric rating, including client-side validation and success/error handling.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the star rating to write answer"
        ]
      },
      "acceptanceCriteria": [
        "Frontend save payload uses a written answer string instead of a rating number.",
        "Client-side validation prevents saving empty/whitespace-only answers and shows an appropriate error (toast or inline error consistent with existing patterns).",
        "On successful save, the Saved Answers query is invalidated/refreshed as it is today.",
        "Backend canister exposes a save method that accepts the written answer and stores it with questionId and timestamp."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the backend Answer record shape and the getAllAnswers response to include the written answer (and remove rating), and update the frontend Saved Answers view to display the written answer text for each saved entry.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the star rating to write answer"
        ]
      },
      "acceptanceCriteria": [
        "Backend Answer type contains questionId, answerText (written answer), and timestamp (no rating field).",
        "Saved Answers view no longer renders star icons/ratings.",
        "Saved Answers view renders the written answer text for each saved entry in a readable, themed layout.",
        "The app builds successfully with updated candid/type bindings and no TypeScript errors from outdated Answer/rating fields."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only add backend/migration.mo if a state upgrade is required by the implementation.",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add third-party auth providers (Internet Identity remains the only supported auth).",
    "Do not add real-time features (e.g., WebSockets/live updates).",
    "Do not keep or display star ratings once written answers are implemented (star rating input/history is replaced, not duplicated)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}